Revit 2026 API

# ColorWithTransparencySetGreen Method

---

set green

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetGreen(
	uint green
)
```
```vb
Public Sub SetGreen (
	green As UInteger
)
```
```cpp
public:
void SetGreen(
	unsigned int green
)
```
```fsharp
member SetGreen :
        green : uint32 -> unit
```

#### Parameters

green UInt32
     green

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | The value is not valid. The valid range is 0 to 255. |

#### Reference

ColorWithTransparency Class

Autodesk.Revit.DB Namespace